#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=cf6b47f0bf5327a85c5b462c02edc7b6ea6deb38]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hYWJlZTBhNy1hMWUxLTQ0ZDctOGFiZi00MzE1YmRiNzhiZGY7b2JqZWN0SWQ9NGQwZTMwOTAtN2RmMy00OWYzLWFmNzctMTlkYTE5MTY1ZTAzO3N1YnNjcmlwdGlvbklkPTc0MWI0MjM4LTc1N2YtNDlmNS1hZmQxLTk1MmU3YTI2MDUzYjt0ZW5hbnRJZD0yNWQ3ZmUyMi00MDAyLTRkY2MtYjljNy1lYjEwMTAzMjgyNjQ=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/741b4238-757f-49f5-afd1-952e7a26053b/resourceGroups/sk-20230105-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/741b4238-757f-49f5-afd1-952e7a26053b/resourceGroups/sk-20230105-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/741b4238-757f-49f5-afd1-952e7a26053b/resourceGroups/sk-20230105-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/741b4238-757f-49f5-afd1-952e7a26053b/resourceGroups/sk-20230105-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/741b4238-757f-49f5-afd1-952e7a26053b/resourceGroups/sk-20230105-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/741b4238-757f-49f5-afd1-952e7a26053b/resourceGroups/sk-20230105-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-different-machine" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "396f861c-b77d-4041-a3b7-f632228c8a09" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (14 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_2918ca594d054abfa1c5235ab9a848f5" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @skingston, Action: `pull_request`*